CBMA/target/classes/ApiRequests/001/UpdateWOStatusToComplete.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wor="http://webservices.cox.com/WorkOrderUpdate">
   <soapenv:Header>
  <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility">
   <wsse:UsernameToken>
    <wsse:Username>dskuser</wsse:Username>
    <wsse:Password Type="wsse:PasswordText">test</wsse:Password>
    <wsse:Nonce>9GicjrpmlnewtCa8Lon29KDX+fA=</wsse:Nonce>
    <wsu:Created>2013-09-25T15:43:09Z</wsu:Created>
   </wsse:UsernameToken>
  </wsse:Security>
       </soapenv:Header>
   <soapenv:Body>
      <wor:UpdateWorkOrderStatusToComplete>
         <wor:siteID>$SiteID$</wor:siteID>
         <!--Optional:-->
         <wor:workOrderNumber>$WorkOrder$</wor:workOrderNumber>
         <wor:techNumber>0</wor:techNumber>
         <!--Optional:-->
         <wor:primaryFindingCode>98</wor:primaryFindingCode>
        
         <wor:primarySolutionCode>70</wor:primarySolutionCode>
         <!--Optional:-->
         
         
         <wor:dispatchComments>testing</wor:dispatchComments>
         <wor:completionTime>01</wor:completionTime>
         <wor:arrivalTime>01</wor:arrivalTime>
      </wor:UpdateWorkOrderStatusToComplete>
   </soapenv:Body>
</soapenv:Envelope>